podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SPI0_PCSIS4_MKW41Z4.svd.xml
            <register>
               <name>SR</name>
               <description>Status register</description>
               <addressOffset>0x2C</addressOffset>
               <resetValue>0x2000000</resetValue>
               <fields>
                  <field>
                     <name>POPNXTPTR</name>
                     <description>Pop Next Pointer\n
Contains a pointer to the RX FIFO entry to be returned when the POPR is read.\n
The POPNXTPTR is updated when the POPR is read</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RXCTR</name>
                     <description>RX FIFO Counter\n
Indicates the number of entries in the RX FIFO.\n
The RXCTR is decremented every time the POPR is read.\n
The RXCTR is incremented every time data is transferred from the shift register to the RX FIFO</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXNXTPTR</name>
                     <description>Transmit Next Pointer\n
Indicates which TX FIFO entry is transmitted during the next transfer.\n
The TXNXTPTR field is updated every time SPI data is transferred from the TX FIFO to the shift register</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXCTR</name>
                     <description>TX FIFO Counter\n
Indicates the number of valid entries in the TX FIFO.\n
The TXCTR is incremented every time the PUSHR is written.\n
The TXCTR is decremented every time an SPI command is executed and the SPI data is transferred to the shift register</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RFDF</name>
                     <description>Receive FIFO Drain Flag\n
Provides a method for the DSPI to request that entries be removed from the RX FIFO.\n
The bit is set while the RX FIFO is not empty.\n
The RFDF bit can be cleared by writing 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Rx FIFO is empty</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Rx FIFO is not empty</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RFOF</name>
                     <description>Receive FIFO Overflow Flag\n
Indicates an overflow condition in the RX FIFO.\n
The field is set when the RX FIFO and shift register are full and a transfer is initiated.\n
The bit remains set until it is cleared by writing a 1 to it</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No Rx FIFO overflow</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Rx FIFO overflow has occurred</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TFFF</name>
                     <description>Transmit FIFO Fill Flag</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tx FIFO is full</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Tx FIFO is not full</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TFUF</name>
                     <description>Transmit FIFO Underflow Flag</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No Tx FIFO underflow</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Tx FIFO underflow</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EOQF</name>
                     <description>End of Queue Flag\n
Indicates if EOQ is set in the executing command</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>EOQ not set</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>EOQ set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXRXS</name>
                     <description>TX and RX Status\n
Indicates the status of transmit and receive operations</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tx/Rx disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Tx/Rx enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TCF</name>
                     <description>Transfer Complete Flag</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Transfer not complete</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Transfer complete</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSER</name>
               <description>DMA/Interrupt Request Select and Enable Register</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>RFDF_DIRS</name>
                     <description>Receive FIFO Drain DMA or Interrupt Request Select\n
Selects between generating a DMA request or an interrupt request</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupt request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>DMA request</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RFDF_RE</name>
                     <description>Receive FIFO Drain Request Enable\n
Enables the RFDF flag in the SR to generate a request.\n
The RFDF_DIRS bit selects between generating an interrupt request or a DMA request</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Requests disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Requests enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RFOF_RE</name>
                     <description>Receive FIFO Overflow Request Enable\n
Enables the RFOF flag in the SR to generate an interrupt request</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupts disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupts enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TFFF_DIRS</name>
                     <description>Transmit FIFO Fill DMA or Interrupt Request Select\n
Selects between generating a DMA request or an interrupt request</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupt requests</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>DMA requests</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RFDF_RE" > <name>TFFF_RE</name> <description>Transmit FIFO Fill Request Enable\n
Enables the TFFF flag in the SR to generate a request. The TFFF_DIRS bit selects between generating
an interrupt request or a DMA request</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="RFOF_RE" > <name>TFUF_RE</name> <description>Transmit FIFO Underflow Request Enable\n
Enables the TFUF flag in the SR to generate an interrupt request</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="RFOF_RE" > <name>EOQF_RE</name> <description>DSPI Finished Request Enable\n
Enables the EOQF flag in the SR to generate an interrupt request</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="RFOF_RE" > <name>TCF_RE</name> <description>Transmission Complete Request Enable\n
Enables TCF flag in the SR to generate an interrupt request</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PUSHR</name>
               <description>PUSH TX FIFO Register In Master Mode</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>Transmit Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PCS</name>
                     <description>Select which PCS signals are to be asserted for the transfer</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Negate PCSx</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Assert PCSx</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTCNT</name>
                     <description>Clear Transfer Counter</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Write 1 to clear TCNT</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EOQ</name>
                     <description>End Of Queue\n
Indicates if this data is the last in this transmission</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not last</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Is last</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTAS</name>
                     <description>Clock and Transfer Attributes Select</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>CTAR0</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>CTAR1</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Reserved</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Reserved</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>Reserved</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>Reserved</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>Reserved</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>Reserved</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CONT</name>
                     <description>Continuous Peripheral Chip Select Enable\n
Determines if PCS remains asserted between transfers</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PCSx returns to inactive\tbetween transfers</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>PCSx stays asserted\tbetween transfers</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUSHR_SLAVE</name>
               <?hide?>
               <description>PUSH TX FIFO Register In Slave Mode</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>Transmit Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>POPR</name>
               <description>POP RX FIFO Register</description>
               <addressOffset>0x38</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>Received Data</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>TXFR%s</name>
               <description>Transmit FIFO</description>
               <addressOffset>0x3C</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>Transmit Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>TXCMD_TXDATA</name>
                     <description>Transmit Command or Transmit Data</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>RXFR%s</name>
               <description>Receive FIFO</description>
               <addressOffset>0x7C</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>Receive Data</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
